## Importing Pandas

In [3]:
import pandas as pd

In [6]:
#instantiating a pandas dataframe object
df = pd.DataFrame()
#creating a column of numeric attributes
df['num1'] = [10, 23, 45, 90, 46, 34, 10]
#creating a column with fractional variables
df['frac'] = [0.234, 0.123, 0.4353, 21.34, 45.00, 30.20, 90.045]
#creating categorical columns
df['cat1'] = ['a', 'b', 'c', 'd', 'a', 'c', 'b']
df['cat2'] = ['x', 'y', 'x', 'x', 'y', 'y', 'x']
#creating a dummy datetime column
df['date_col'] = ['1990-08-3', '2000-07-21', '1998-06-17', '2021-06-30', '1776-07-4', '2001-09-11', '2010-02-17']

## Print out Different parts of the code.

In [7]:
df.head(3)

   num1    frac cat1 cat2    date_col
0    10  0.2340    a    x   1990-08-3
1    23  0.1230    b    y  2000-07-21
2    45  0.4353    c    x  1998-06-17

In [8]:
 #A statistical summary of your numeric columns can be obtained as:
df.describe()

            num1       frac
count   7.000000   7.000000
mean   36.857143  26.768186
std    27.739434  32.876148
min    10.000000   0.123000
25%    16.500000   0.334650
50%    34.000000  21.340000
75%    45.500000  37.600000
max    90.000000  90.045000

In [9]:
 #to determine the memory consumption of each colum in bytes:- this is important in evaluating the suitability of your computing resources
df.memory_usage(deep=True)

Index       128
num1         56
frac         56
cat1        406
cat2        406
date_col    467
dtype: int64

In [10]:
 #To know the datatypes of our columns:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   num1      7 non-null      int64
 1   frac      7 non-null      float64
 2   cat1      7 non-null      object
 3   cat2      7 non-null      object
 4   date_col  7 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 408.0+ bytes

In [18]:
df['num5'] = df['num1'].astype('float64')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   num1      7 non-null      int64
 1   frac      7 non-null      float64
 2   cat1      7 non-null      object
 3   cat2      7 non-null      object
 4   date_col  7 non-null      object
 5   num3      7 non-null      float64
 6   num5      7 non-null      float64
dtypes: float64(3), int64(1), object(3)
memory usage: 520.0+ bytes

In [20]:
#printing few columns and rows
df.loc[0:4, ['date_col', 'num3']]

     date_col  num3
0   1990-08-3  10.0
1  2000-07-21  23.0
2  1998-06-17  45.0
3  2021-06-30  90.0
4   1776-07-4  46.0

In [21]:
#creating a copy of your dataframe
df_copy = df.copy()
df_copy.head(2)

   num1   frac cat1 cat2    date_col  num3  num5
0    10  0.234    a    x   1990-08-3  10.0  10.0
1    23  0.123    b    y  2000-07-21  23.0  23.0

In [24]:
#dropping columns
drop_cols = df.drop(columns=['num3'])
drop_cols.head(2)

   num1   frac cat1 cat2    date_col  num5
0    10  0.234    a    x   1990-08-3  10.0
1    23  0.123    b    y  2000-07-21  23.0

In [25]:
drop_cols = df.drop(columns=['date_col', 'num3'])
drop_cols.head(2)

   num1   frac cat1 cat2  num3  num5
0    10  0.234    a    x  10.0  10.0
1    23  0.123    b    y  23.0  23.0

In [26]:
#drop date_col and num3
drop_cols = df.drop(columns=['date_col', 'num3'])
drop_cols.head(2)

   num1   frac cat1 cat2  num5
0    10  0.234    a    x  10.0
1    23  0.123    b    y  23.0

In [ ]:
#columns can be merged horizontally as follows:
#note that we are mergingt the column we had dropped to the remaining df to have the original df_copy
df_copy_original = pd.concat([df_copy, drop_cols], axis=0)
df_copy_original.head(2)